<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"a22daeab53ccce35f4406aeca8cf0ab393594fe57164bf4400ac16a76a79a3cc","plan_job_ref":"Job PR Plan #10 at https://github.com/cabinetoffice/gpa-rosy-iac/actions/runs/13910202346","plan_out_hash":"6122ed626fe9d1e3a523754d3a890e377f1b3a48dc86e90f8f52831a54f88416","plan_hash":"4eca010e85f64c0d5aaf3ced15a12fdef2a00aae2a39a510df527f4f0731e3c2","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 10 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_emr_cluster.emr_cluster will be created
+   resource "aws_emr_cluster" "emr_cluster" {
+       applications                      = [
+           "Hadoop",
+           "Hive",
        ]
+       arn                               = (known after apply)
+       cluster_state                     = (known after apply)
+       configurations_json               = jsonencode(
            [
+               {
+                   Classification = "spark"
+                   Properties     = {
+                       maximizeResourceAllocation = "true"
                    }
                },
            ]
        )
+       id                                = (known after apply)
+       keep_job_flow_alive_when_no_steps = (known after apply)
+       log_uri                           = "s3://aws-logs-650066862270-eu-west-2/elasticmapreduce/logs/"
+       master_public_dns                 = (known after apply)
+       name                              = "ioblend_propscbgth_emr_cluster"
+       release_label                     = "emr-6.10.0"
+       scale_down_behavior               = (known after apply)
+       service_role                      = "horizon_data_extract_propscbgth_emr_role"
+       step                              = (known after apply)
+       step_concurrency_level            = 1
+       tags                              = {
+           "Environment" = "dev"
+           "Project"     = "datahub-ioblend-emr"
        }
+       tags_all                          = {
+           "Env"         = "dev"
+           "Environment" = "dev"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "datahub-ioblend-emr"
        }
+       termination_protection            = (known after apply)
+       visible_to_all_users              = true

+       bootstrap_action {
+           name = "Install libraries"
+           path = "s3://rosy-dev-emr-test/bootstrap/bootstrap_proactis_dev_test.sh"
        }

+       core_instance_fleet (known after apply)

+       core_instance_group {
+           id             = (known after apply)
+           instance_count = 2
+           instance_type  = "m5.xlarge"

+           ebs_config (known after apply)
        }

+       ec2_attributes {
+           emr_managed_master_security_group = "sg-0d0e55abe696b99c1"
+           emr_managed_slave_security_group  = "sg-036a1b25dea994f49"
+           instance_profile                  = "horizon_data_extract_emr_ec2_instance_profile"
+           key_name                          = "ec2-key-pair"
+           service_access_security_group     = (known after apply)
+           subnet_id                         = "************************"
+           subnet_ids                        = (known after apply)
        }

+       master_instance_fleet (known after apply)

+       master_instance_group {
+           id             = (known after apply)
+           instance_count = 1
+           instance_type  = "m5.xlarge"

+           ebs_config (known after apply)
        }
    }

  # aws_iam_instance_profile.emr_instance_profile will be created
+   resource "aws_iam_instance_profile" "emr_instance_profile" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "horizon_data_extract_emr_ec2_instance_profile"
+       name_prefix = (known after apply)
+       path        = "/"
+       role        = "horizon_data_extract_emr_ec2_role"
+       tags_all    = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
+       unique_id   = (known after apply)
    }

  # aws_iam_policy.horizon_s3_access_policy will be created
+   resource "aws_iam_policy" "horizon_s3_access_policy" {
+       arn         = (known after apply)
+       description = "Policy to allow S3 bucket access"
+       id          = (known after apply)
+       name        = "horizonS3AccessPolicy"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:GetObject",
+                           "s3:PutObject",
+                           "s3:ListBucket",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::horizon-extract-propscbgth-dev",
+                           "arn:aws:s3:::horizon-extract-propscbgth-dev/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
    }

  # aws_iam_role.emr_ec2_instance_role will be created
+   resource "aws_iam_role" "emr_ec2_instance_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "horizon_data_extract_emr_ec2_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.emr_service_role will be created
+   resource "aws_iam_role" "emr_service_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "elasticmapreduce.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "horizon_data_extract_propscbgth_emr_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.horizon_extract_role will be created
+   resource "aws_iam_role" "horizon_extract_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "horizon-extract-s3-access-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Env"       = "dev"
+           "ManagedBy" = "Terraform"
+           "Project"   = "gpa-datahub-ioblend-emr-dev"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_policy will be created
+   resource "aws_iam_role_policy_attachment" "attach_policy" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "horizon-extract-s3-access-role"
    }

  # aws_iam_role_policy_attachment.emr_ec2_policy will be created
+   resource "aws_iam_role_policy_attachment" "emr_ec2_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonElasticMapReduceforEC2Role"
+       role       = "horizon_data_extract_emr_ec2_role"
    }

  # aws_iam_role_policy_attachment.emr_service_policy will be created
+   resource "aws_iam_role_policy_attachment" "emr_service_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonElasticMapReduceRole"
+       role       = "horizon_data_extract_propscbgth_emr_role"
    }

  # aws_s3_bucket.horizon-extract-propscbgth-dev will be created
+   resource "aws_s3_bucket" "horizon-extract-propscbgth-dev" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "horizon-extract-propscbgth-dev"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "dev"
+           "Name"        = "horizon-extract-propscbgth-dev"
        }
+       tags_all                    = {
+           "Env"         = "dev"
+           "Environment" = "dev"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "horizon-extract-propscbgth-dev"
+           "Project"     = "gpa-datahub-ioblend-emr-dev"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   emr_cluster_id = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_account_id" but a
value was found in file "env_vars/variables_dev.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "role_to_assume_arn" but a
value was found in file "env_vars/variables_dev.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [PR Plan #10](https://github.com/cabinetoffice/gpa-rosy-iac/actions/runs/13910202346)